[
    "Who was your first crush, or who is your current crush?",
    "How old were you when you had your first kiss?",
    "What would you do if your current boyfriend/girlfriend ended things right now?",
    "Have you ever cheated on a boyfriend/girlfriend?",
    "Have you ever been cheated on by a boyfriend/girlfriend?",
    "If you could go on a date with anyone in the room, who would it be?",
    "What personality traits would cause you to end a friendship?",
    "Would you go behind a friend's back with a crush?",
    "Have you ever lied to your best friend?",
    "Would you ever cheat off a friends paper?",
    "How many different best friends have you had during your lifetime?",
    "If you were stuck on a deserted island, which friend would you want with you?",
    "How long have you gone without showering?",
    "Have you ever told a lie during a game of Truth or Dare? What was it and why?",
    "Have you ever had a crush on anyone here?",
    "Have you ever stolen anything?",
    "What's your scariest nightmare?",
    "What do you think is your biggest physical flaw?",
    "Have you ever gone skinny dipping?",
    "What kind of pajamas do you wear to bed?",
    "What's the dumbest thing you've ever done on a dare?",
    "What color is your underwear?",
    "Have you ever peed in the swimming pool?",
    "If you weren't here, what would you be doing?",
    "If you couldn't go to the college or get the job of your dreams, what would you do?",
    "What is one thing you've never told anyone else?",
    "What do you want to be when you grow up?",
    "What kind of person do you want to marry someday?",
    "Do you want to have kids? How many?",
    "If you could switch places with someone for a day, who would it be?",
    "If you could invent anything, what would it be?",
    "If you knew the world was about to end, what would you do?",
    "If you could be born again, who would you come back as?",
    "Are you scared of dying? Why?",
    "What is your biggest fear?",
    "What happened on worst day of your life?",
    "Have you ever climbed a tree?",
    "Have you ever sang and danced in the grocery store?",
    "If you could be a superhero, what would your power be?",
    "What would you do if you were invisible for a day?",
    "If you life were made into a movie, who would play you?",
    "What's your biggest pet peeve?",
    "What is your special talent?",
    "What's the best meal you've ever had?",
    "What's you favorite Disney movie and why?",
    "What would you do with a million dollars if you ever won the lottery?"
]